package org.teiath.ellak.ellakandroideducation;

/**
 * Χειρίζεται το update της βάσης δεδομένων. Περιέχει μεθόδους μέσω των οποίων γίνεται σύνδεση σε ftp server,
 * συγκρίνεται η έκδοση της βάσης δεδομένων του server με την τοπική βάση δεδομένων και αν χρειάζεται κατεβαίνει
 * η νεότερη βάση και τα συνοδευτικά της αρχεία (εικόνες).
 */
public class UpdateHandler
{
    private static UpdateHandler ourInstance = new UpdateHandler ();

    /**
     * Επιστρέφει αναφορά στο μοναδικό αντικείμενο που δημιουργείται από την κλάση/
     * @return
     */
    public static UpdateHandler getInstance ()
    {
        return ourInstance;
    }

    /**
     * Ο κατασκευαστής τους αντικειμένου. Εδώ πραγματοποιούνται κάποιες αρχικοποιήσεις.
     */
    private UpdateHandler ()
    {

    }

    /**
     * Επιστρέφει την έκδοση της βάσης δεδομένων η οποία βρίσκεται στον server. Αν δεν υπάρχει επικοινωνία με τον server
     * επιστρέφει 0
     * @return Η έκδοση της βάσης δεδομένων στον server
     */
    public float GetVersion ()
    {
        return 0.0f;
    }

    /**
     * Κατεβάζει τη νέα έκδοση της βάσης δεδομένων και αντικαθιστά με αυτή την τρέχουσα βάση δεδομένων.
     * @return true αν η διαδικασία ολοκληρώθηκε κανονικά, false αν παρουσιάστηκε κάποιο σφάλμα.
     */
    public boolean GetNewDB ()
    {
        return false;
    }

    /**
     * Κατεβάζει ένα αρχείο από τον server και το τοποθετεί στην κατάλληλη θέση. Το αρχείο, λογικά, είναι εικόνα η
     * οποία υπάρχει στην νέα βάση και δεν υπήρχε στην προηγούμενη.
     * @param Fn
     * @return
     */
    public boolean GetFile (String Fn)
    {
        return false;
    }

    /**
     * Ελέγχει αν όλες οι εικόνες οι οποίες αναφέρονται στη βάση δεδομένων υπάρχουν στον κατάλογο της εφαρμογής. Αν
     * κάποιες λείπουν τις κατεβάζει. Επίσης ελέγχει αν υπάρχουν εικόνες οι οποίες δεν χρειάζονται πλέον και τις σβήνει.
     */
    public void CheckImages ()
    {

    }
}
